Revit 2026 API

# ElectricalLoadType Enumeration

---

Represents the electrical load type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ElectricalLoadType
```
```vb
Public Enumeration ElectricalLoadType
```
```cpp
public enum class ElectricalLoadType
```
```fsharp
type ElectricalLoadType
```

| Member name | Value | Description |
| --- | --- | --- |
| AreaBasedLoad | 1 | Area Based Load |
| EquipmentLoad | 0 | Equipment Load |

#### Reference

Autodesk.Revit.DB.Electrical Namespace